Revit 2026 API

# ExportDWGSettingsSetDXFExportOptions Method

---

Sets the options stored in these settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetDXFExportOptions(
	DXFExportOptions options
)
```
```vb
Public Sub SetDXFExportOptions (
	options As DXFExportOptions
)
```
```cpp
public:
void SetDXFExportOptions(
	DXFExportOptions^ options
)
```
```fsharp
member SetDXFExportOptions :
        options : DXFExportOptions -> unit
```

#### Parameters

options DXFExportOptions
     The options.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportDWGSettings Class

Autodesk.Revit.DB Namespace